{"meta":{"title":"RoyalRoader","subtitle":"Blog Powered by Hexo","description":"Blog Powered by Hexo","author":"RoyalRoader","url":"http://royalroader.github.io"},"pages":[],"posts":[{"title":"알고리즘 소개","slug":"Basic-Algorithm","date":"2018-04-22T04:48:07.000Z","updated":"2018-04-23T15:27:28.244Z","comments":true,"path":"2018/04/22/Basic-Algorithm/","link":"","permalink":"http://royalroader.github.io/2018/04/22/Basic-Algorithm/","excerpt":"","text":"DEF. for AlgorithmApplying a technique to a problem results in a step-by-step procedure for solving the problem. This step-by-step procedure is called an algorithm for the problem. The purpose of studying these techniques and their applications is so that, when confronted with a new problem, you have a repertoire of techniques to consider as possible ways to solve the problem. In addition, we will be concerned not only with determining whether a problem can be solved using a given technique but also with analyzing how efficient the resulting algorithm is in terms of time and storage.","categories":[{"name":"Algorithms","slug":"Algorithms","permalink":"http://royalroader.github.io/categories/Algorithms/"},{"name":"Basic","slug":"Algorithms/Basic","permalink":"http://royalroader.github.io/categories/Algorithms/Basic/"}],"tags":[]},{"title":"Hexo 명령어","slug":"hexo_quick_start","date":"2018-04-21T15:00:00.000Z","updated":"2018-04-23T15:30:18.223Z","comments":true,"path":"2018/04/22/hexo_quick_start/","link":"","permalink":"http://royalroader.github.io/2018/04/22/hexo_quick_start/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"수출입개요","slug":"수출입개요","date":"2017-10-28T12:47:00.000Z","updated":"2018-04-23T15:14:15.126Z","comments":true,"path":"2017/10/28/수출입개요/","link":"","permalink":"http://royalroader.github.io/2017/10/28/수출입개요/","excerpt":"","text":"수출입거래 수출의 정의[대외무역법상]-매매, 교환, 임대차, 사용대차, 증여 등을 원인으로 국내에서 외국으로 물품이 이동하는 것.-보세판매장에서 외국인에게 국내에서 생산된 물품을 매도하는 것.-유상으로 외국에서 외국으로 물품을 인도하는 것.-거주자가 비거주자에게 산업통상자원부장관이 정하여 고시하는 방법으로 용역을 제공하는 것.-거주자가 비거주자에게 정보통신망을 통한 전송과 전자적 형태의 무체물을 인도하는 것.[관세법상]-내국물품을 외국으로 반출하는 것. 수입의 정의[관세법상] 외국물품을 우리나라에 반입하거나 우리나라에서 소비 또는 사용하는 것. 거래대상 물품, 용역(혹은 서비스), 정보통신망을 통한 전송 및 전자적 형태의 무체물. 무상으로 외국에서 외국으로 물품을 인수받는 것은 대외무역법상 수입 거래가 아님. 거래주체 개인과 법인 모두 수출입거래 가능. 무역거래자 : 일반무역업자, 무역대리업자 무역업고유번호 부여 받을 수 있으나 무역업을 하는데 있어 필수는 아님. 거래특징 언어 이슈 : 수출입계약 관련 서류 작성시 어느 언어를 기준으로 할지 통화결정 이슈 : 어느 통화를 결제통화로 할지 통관 이슈 : 수출국 및 수입국 세관에서의 통관절차 필요 국제운송 이슈 : 복합운송, 해상운송, 항공운송 법적 이슈 : 무역클레임이 발생하여 이를 소송으로 해결시 준거법과 재판관할권의 이슈가 발생• 준거법(Governing law) : 어느 국가의 법률로 해석할 것인지• 재판관할권(Jurisdiction) : 소송이 진행될 법정은 어디인지 특정거래 형태의 수출입범위 설명 위탁판매수출 국내 수출기업이 해외 수입기업에게 소유권을 이전하지 않은 상태에서 물품 등을 무환으로 수출하고 해당 물품이 판매된 범위 안에서 대금을 결제받는 계약에 의한 수출. 수출상(위탁자)이 수입업자(수탁자) 앞으로 판매를 위탁하는 형태. 수탁판매수입 해외 수출기업(위탁자)으로부터 국내 수입기업(수탁자)이 소유권을 이전받지 않은 상태에서 물품 등을 무환으로 수입하여 해당 물품이 판매된 범위 안에서 대금을 결제하는 계약에 의한 수입. 위탁가공무역 외국에서 가공할 원료의 전부 또는 일부를 거래 상대방에게 수출하거나 외국에서 조달하여 이를 가공한 후 가공물품 등을 수입하거나 외국으로 인도하는 수출입. 수탁가공무역 가득액을 영수하기 위하여 원자재의 전부 또는 일부를 거래 상대방의 위탁에 의하여 수입하여 이를 가공한 후 위탁자 또는 그가 지정하는 자에게 가공물품 등을 수출하는 수출입. 임대수출 임대계약에 의하여 물품 등을 수출하여 일정기간 후 다시 수입하거나 그 기간의 만료 전 또는 만료 후 해당 물품 등의 소유권을 이전하는 수출. 임차수입 임차계약에 의하여 물품 등을 수입하여 일정기간 후 다시 수출하거나 그 기간의 만료 전 또는 만료 후 해당 물품의 소유권을 이전받는 수입. 연계무역 물물교환, 구상무역, 대응구매, 제품환매 등의 형태로 수출과 수입이 연계되어 이루어지는 수출입. 중계무역 수출을 목적으로 물품 등을 수입하여 국내에 반입하지 않고 수출하는 수입.• [해외수입업체] ←(수입)→ [중계상] ←(수출)→ [최종공급업체] (신용장 개설방법#1)• 해외수입업체의 요청에 의해 중계상 앞으로 개설되는 신용장 : master L/C• 중계상의 요청에 의해 최종공급업체 앞으로 개설되는 신용장 : back-to-back L/C (신용장 개설방법#2)• 중계상의 요청에 의해 master L/C를 최종공급업체 앞으로 양도. 외국인수수입 수입대금은 국내에서 지급되지만 수입 물품 등은 외국에서 인수하거나 제공받는 수입. 외국인도수출 수출대금은 국내에서 영수하지만 국내에서 통관되지 아니한 수출 물품 등을 외국으로 인도하거나 제공하는 수출. 무환수출입 외국환 거래가 수반되지 아니하는 물품 등의 수출수입. 수출입 거래 관련 주요 서류 상업송장(Commercial Invoice) 운송서류(Transport Document) 포장명세서(Packing List) 원산지증명서(Certificate of Origin) 환어음(Draft, Exchange of Bill) 보험서류 등(Insurance Document) 수출입거래의 위험요인 및 위험 관리 방안 신용위험 및 국가위험: 선수금방식 수출, 신용장, 무보 단기수출보험 국제운송 관련 위험: 적하보험 법률적 위험: 상시중재제도 활용, 법무법인, 관세법인 등 업계전문가 자문 활용 등 환위험: 환리스크 관리기법 활용(선물환거래, 통화옵션, 통화스왑, 결제시기 의도적 조정) 물품 품질에 대한 위험: 검사증명서, 독립적이고 국제적인 검사기관 등 수출입기업 관련 수출기업의 의무-물품에 대한 소유권 이전 의무-물품인도 의무-물품에 대한 서류교부 의무-물품에 대한 계약적합 의무 수입기업의 의무-대금지급 의무-물품인도에 대한 수령 의무-물품검사 의무-물품의 부적합에 대한 통지 의무 수출기업의 장점-수출하는 재화나 용역에 대하여는 부가가치세 영세율이 적용됨.-관세환급제도 수혜 수입기업의 장점-해당 물품을 국내에 공급하여 매출증대와 영업이익 창출. 수출입물품 계약수출입물품에 대한 매매계약은 거래의 한 당사자(청약자)의 청약(offer)에 대해 상대방(피청약자)이 승낙(acceptance)하는 경우 성립된다. 이때 승낙은 무조건적 승낙이어야 한다. 청약-청약자가 1인 또는 그 이상의 특정인에게 거래조건을 제시하면서 계약을 체결하고 싶다는 의사를 표시하는 것이다.-충분히 확정적이고, 승낙시 그에 구속된다는 청약자의 의사가 표시되어야 하며, 청약의 상대방은 불특정 다수가 아닌 특정인이어야 한다. 청약 → 무조건적 승낙 → 계약 성립 O 청약 → 조건부 승낙 → 계약 성립 X 수출입통관 수출통관－통관절차: 수출하고자 하는 물품을 세관에 수출신고를 한 후 신고수리를 받아 물품을 우리나라외 외국 간을 왕래하는 운송수단에 적재하기까지의 절차이다.－수출신고: 수출물품 소유자나 관세사가 관세청 통관시스템에 전송하는 방법이다.－수출신고필증: 세관에서 수출신고가 수리된 때 수출신고필증이 교부 된다. 수입통관-통관절차: 수입하고자 하는 물품을 세관에 수입신고를 한 후 신고수리를 받아 수입물품이 반출될 수 있도록 하는 일련의 과정이다.-수입신고: 관세사나 일정한 요건을 갖춘 수입화주가 할 수 있다.-수입신고필증: 세관에서 수입신고가 수리된 때 수입신고필증이 교부 된다.-수입 신고시기 : ①출항 전 신고 ②입항 전 신고 ③보세구역 도착전 신고 ④보세구역에 장치 후 신고 외국환거래 약정거래기업이 은행과 수출입금융 거래(신용장 개설, 수출환어음 매입 등)를 하려면 기본적으로 외국환거래 약정 체결 필요. 외화환전, 수입대금 송금거래, 수출대금 영수거래는 외국환거래 약정서의 적용범위에 포함되지 않음. 수입신용장 발행은 직무전결 규정에서 정하는 여신전결권자의 승인을 받아야 함. 은행은 외국환거래 약정서가 특별히 변경되지 않는 한 수출거래나 수입거래를 최초로 거래하는 경우에 징구하면 됨. 무역거래에 관한 정형거래 조건(INCOTERMS2010) 운송 방식별 분류 모든 운송방식에 사용가능 조건: EXW, FCA, CPT, CIP, DAP, DAT, DDP 해상운송(내수로 운송)에만 사용되는 조건: FAS, FOB, CFR, CIF 운임 부담자별 분류 매도인(수출상)이 운임을 부담하는 조건: CFR, CPT, CIF, CIP, DAP, DAT, DDP 매수인(수입상)이 운임을 부담하는 조건: EXW, FCA, FAS, FOB 보험 가입자별 분류 매도인이(수출상)이 부보하는 조건: CIF, CIP 매수인(수입상)이 부보하는 조건: EXW, FCA, FAS, FOB, CFR, CPT 위험이전 분기점별 부류 매도인(수출상)의 위험부담이 수출지에서 종료되는 조건: EXW, FCA, FAS, FOB, CFR, CPT, CIF, CIP 매도인(수출상)의 위험부담이 수입지에서 종료되는 조건: DAP, DAT, DDP","categories":[{"name":"Finance","slug":"Finance","permalink":"http://royalroader.github.io/categories/Finance/"},{"name":"Foreign Exchange","slug":"Finance/Foreign-Exchange","permalink":"http://royalroader.github.io/categories/Finance/Foreign-Exchange/"}],"tags":[]},{"title":"민·상법개요","slug":"민상법개요","date":"2015-10-18T14:18:00.000Z","updated":"2018-04-23T15:14:52.979Z","comments":true,"path":"2015/10/18/민상법개요/","link":"","permalink":"http://royalroader.github.io/2015/10/18/민상법개요/","excerpt":"","text":"민·상법의 의의민법은 사법이고, 일반법이며, 또한 실체법이다. 상법은 기업관계를 규율하는 법이며, 사법이며 실체법이지만, 민법의 특별법이다. 민·상법의 법원법원이란 외부에 나타난 법의 존재형식 또는 현상이다. 우리나라는 성문법주의를 택하므로 성문법이 제1차적인 법원이 되며, 불문법도 일부 법원이 된다. 법원의 적용순서 일반법 vs. 특별법: 특별법우선원칙 적용 성문법 vs. 관습법: 성문법우선원칙 적용 상사거래에서는 상사자치법이 가장 우선하는 법원이 된다. 민·상법의 기본원리 근대민법의 기본원리 사유재산권 존중의 원칙 사적자치의 원칙 과실책임의 원칙 민법의 기본원리 공공복리를 최고이념으로 한다. 신의성실의 원칙 권리남용 금지의 원칙 거래안전 및 사회질서의 원칙에 의하여 제한되거나 수정되는 범위내 상법의 기본원리 기업의 건전한 발전을 도모한다. 기업 활동의 원활·확실화 기업의 유지·강화를 위한 각종 제도 도입 민·상법의 효력 민법의 효력 그 효력이 생긴 때부터 그 이후에 발생한 사실에 대해서만 적용 모든 대한민국 국민에게 적용(대한민국 영토 내에 있는 외국인에게도 적용) 우리나라 전 영토 내에 그 효력이 미친다. 상법의 효력 특별한 규정이 없으면 상법시행 전에 생긴 사항에 대해서도 효력이 미친다. 사람에 대한 적용범위는 민법의 경우와 원칙으로 같다. 다만, 소상인에게는 일부규정의 적용이 배제된다. 장소에 관한 효력은 민법의 경우와 원칙으로 같다. 상법은 기업적 법률관계에 적용한다.","categories":[{"name":"Finance","slug":"Finance","permalink":"http://royalroader.github.io/categories/Finance/"},{"name":"Law","slug":"Finance/Law","permalink":"http://royalroader.github.io/categories/Finance/Law/"}],"tags":[{"name":"민상법기초","slug":"민상법기초","permalink":"http://royalroader.github.io/tags/민상법기초/"}]}]}